STMicroelectronics/stm32h7s78-dk-bsp/stm32h7s78_discovery_lcd.c
  gpio_init_structure.Pin = GPIO_PIN_9|GPIO_PIN_10;
  gpio_init_structure.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init(GPIOA, &gpio_init_structure);


  gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1| GPIO_PIN_2 | GPIO_PIN_13|GPIO_PIN_14;
  gpio_init_structure.Alternate = GPIO_AF13_LTDC;
  HAL_GPIO_Init(GPIOG, &gpio_init_structure);

  /* VSYNC */
  gpio_init_structure.Pin = GPIO_PIN_11;
  gpio_init_structure.Alternate = GPIO_AF11_LTDC;
  HAL_GPIO_Init(GPIOE, &gpio_init_structure);

  gpio_init_structure.Pin       = GPIO_PIN_0 ;
  gpio_init_structure.Alternate = GPIO_AF11_LTDC;
  HAL_GPIO_Init(GPIOF, &gpio_init_structure);

  gpio_init_structure.Pin   = GPIO_PIN_10|GPIO_PIN_11;
  gpio_init_structure.Alternate = GPIO_AF14_LTDC;
  HAL_GPIO_Init(GPIOF , &gpio_init_structure);

  gpio_init_structure.Pin   = GPIO_PIN_9 | GPIO_PIN_7 | GPIO_PIN_15;
  gpio_init_structure.Alternate = GPIO_AF13_LTDC;
  HAL_GPIO_Init(GPIOF , &gpio_init_structure);

  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
  gpio_init_structure.Pin       = LCD_DISP_EN_PIN;
  HAL_GPIO_Init(LCD_DISP_EN_GPIO_PORT, &gpio_init_structure);

    /** Toggle Sw reset of LTDC IP */
    __HAL_RCC_LTDC_FORCE_RESET();
    __HAL_RCC_LTDC_RELEASE_RESET();
  }
}

/**
  * @brief  De-Initializes the BSP LTDC Msp
  * @param  hltdc  LTDC handle
  * @retval None
  */
static void LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc)
{
  GPIO_InitTypeDef  gpio_init_structure;

  if (hltdc->Instance == LTDC)
  {
    /* LTDC Pins deactivation */
    /* GPIOA deactivation */
    gpio_init_structure.Pin       = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_8|GPIO_PIN_11 |GPIO_PIN_12| GPIO_PIN_15 | GPIO_PIN_6 | GPIO_PIN_9|GPIO_PIN_10;
    HAL_GPIO_DeInit(GPIOA, gpio_init_structure.Pin);

    /* GPIOB deactivation */
    gpio_init_structure.Pin       = GPIO_PIN_13 | GPIO_PIN_15 | GPIO_PIN_3 |GPIO_PIN_4 | GPIO_PIN_10| GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_14;
    HAL_GPIO_DeInit(GPIOB, gpio_init_structure.Pin);

    /* GPIOE deactivation */
    gpio_init_structure.Pin       = GPIO_PIN_11 | GPIO_PIN_15;
    HAL_GPIO_DeInit(GPIOE, gpio_init_structure.Pin);

    /* GPIOF deactivation */
    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_10|GPIO_PIN_11 | GPIO_PIN_9 | GPIO_PIN_7 | GPIO_PIN_15;
    HAL_GPIO_DeInit(GPIOF, gpio_init_structure.Pin);

    /* GPIOG deactivation */
    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1| GPIO_PIN_2 | GPIO_PIN_13|GPIO_PIN_14;
    HAL_GPIO_DeInit(GPIOG, gpio_init_structure.Pin);

    /** Force and let in reset state LTDC */
    __HAL_RCC_LTDC_FORCE_RESET();

    /** Disable the LTDC */
    __HAL_RCC_LTDC_CLK_DISABLE();
  }
}

/**
  * @brief  Initialize the BSP DMA2D Msp.
  * @param  hdma2d  DMA2D handle
  * @retval None
  */
static void DMA2D_MspInit(DMA2D_HandleTypeDef *hdma2d)
{
  if (hdma2d->Instance == DMA2D)
  {
    /** Enable the DMA2D clock */
    __HAL_RCC_DMA2D_CLK_ENABLE();

    /** Toggle Sw reset of DMA2D IP */
    __HAL_RCC_DMA2D_FORCE_RESET();
    __HAL_RCC_DMA2D_RELEASE_RESET();
  }
}

/**
  * @brief  De-Initializes the BSP DMA2D Msp
  * @param  hdma2d  DMA2D handle
  * @retval None
  */
static void DMA2D_MspDeInit(DMA2D_HandleTypeDef *hdma2d)
{
  if (hdma2d->Instance == DMA2D)
  {
    /** Disable IRQ of DMA2D IP */
    HAL_NVIC_DisableIRQ(DMA2D_IRQn);

    /** Force and let in reset state DMA2D */
    __HAL_RCC_DMA2D_FORCE_RESET();

    /** Disable the DMA2D */
    __HAL_RCC_DMA2D_CLK_DISABLE();
  }
}

/**
  * @brief  Initializes TIM MSP.
  * @param  hlptim LPTIM handle
  * @retval None
  */
static void LPTIMx_PWM_MspInit(LPTIM_HandleTypeDef *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlptim);

  GPIO_InitTypeDef gpio_init_structure;

  LCD_BL_CTRL_GPIO_CLK_ENABLE();

  /* LPTIMx Peripheral clock enable */
  LCD_LPTIMx_CLK_ENABLE();

  /* Timer channel configuration */
  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
  gpio_init_structure.Alternate = LCD_LPTIMx_CHANNEL_AF;
  gpio_init_structure.Pin       = LCD_BL_CTRL_PIN; /* BL_CTRL */

  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &gpio_init_structure);
}

/**
  * @brief  De-Initializes LPTIM MSP.
  * @param  hlptim LPTIM handle
  * @retval None
  */
static void LPTIMx_PWM_MspDeInit(LPTIM_HandleTypeDef *hlptim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlptim);

  GPIO_InitTypeDef gpio_init_structure;

  /* LPTIMx Peripheral clock disable */
  LCD_BL_CTRL_GPIO_CLK_DISABLE();

  /* LPTimer channel configuration */
  gpio_init_structure.Pin = LCD_BL_CTRL_PIN; /* BL_CTRL */
  HAL_GPIO_DeInit(LCD_BL_CTRL_GPIO_PORT, gpio_init_structure.Pin);
}

/**
  * @brief  Initializes LPTIM in PWM mode
  * @param  hlptim LPTIM handle
  * @retval None
  */
static void LPTIMx_PWM_Init(LPTIM_HandleTypeDef *hlptim)
{
  LPTIMx_PWM_MspInit(hlptim);

  hlptim->Instance = LCD_LPTIMx;
  (void)HAL_LPTIM_DeInit(hlptim);

  hlptim->Init.CounterSource = LPTIM_COUNTERSOURCE_INTERNAL;
  hlptim->Init.UpdateMode = LPTIM_UPDATE_IMMEDIATE;
  hlptim->Init.Clock.Source = LCD_LPTIMX_CLOCK_SOURCE;
  hlptim->Init.Clock.Prescaler = LCD_LPTIMX_PRESCALER_VALUE;
  hlptim->Init.UltraLowPowerClock.SampleTime = LPTIM_TRIGSAMPLETIME_DIRECTTRANSITION;
  hlptim->Init.Trigger.Source = LPTIM_TRIGSOURCE_SOFTWARE;
  hlptim->Init.Trigger.ActiveEdge = LPTIM_ACTIVEEDGE_RISING;
  hlptim->Init.Trigger.SampleTime = LPTIM_TRIGSAMPLETIME_DIRECTTRANSITION;
  hlptim->Init.Input1Source = LPTIM_INPUT1SOURCE_GPIO;
  hlptim->Init.Input2Source = LPTIM_INPUT2SOURCE_GPIO;
  hlptim->Init.Period = LCD_LPTIMX_PERIOD_VALUE;
  hlptim->Init.RepetitionCounter = 0;
  hlptim->Init.UltraLowPowerClock.Polarity = LPTIM_CLOCKPOLARITY_RISING;

  (void)HAL_LPTIM_Init(hlptim);

  hlcd_lptim_config.Pulse      = LCD_LPTIMX_PULSE_VALUE;
  hlcd_lptim_config.OCPolarity = LPTIM_OCPOLARITY_LOW;
  (void)HAL_LPTIM_OC_ConfigChannel(hlptim, &hlcd_lptim_config, LPTIM_CHANNEL_2);
  Lcd_Ctx[0].Brightness = LCD_BRIGHTNESS_DEFAULT_VALUE;
  (void)HAL_LPTIM_PWM_Start(hlptim, LPTIM_CHANNEL_2);
}

/**
  * @brief De-Initializes LPTIM
  * @param hlptim LPTIM handle
  * @retval None
  */
static void LPTIMx_PWM_DeInit(LPTIM_HandleTypeDef *hlptim)
{
  hlptim->Instance = LCD_LPTIMx;

  /* Timer de-intialization */
  (void)HAL_LPTIM_DeInit(hlptim);

  /* Timer Msp de-intialization */
  LPTIMx_PWM_MspDeInit(hlptim);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */